<a href="https://colab.research.google.com/github/ayushm1998/machinelearning/blob/master/pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

In [0]:
#reading data from csv file 
df=pd.read_csv("com.csv")

In [4]:
#data struture
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
Name          6 non-null object
Department    4 non-null object
Manager       4 non-null object
Salary        6 non-null int64
dtypes: int64(1), object(3)
memory usage: 272.0+ bytes

In [5]:
#to print all the data
df

            Name Department      Manager  Salary
0     Robin Hood        NaN          NaN     200
1  Arsene Wenger        Bar   Friar Tuck      50
2     Friar Tuck        Foo   Robin Hood     100
3    Little John        Foo   Robin Hood     100
4  Sam Allardyce        NaN          NaN     250
5  Dimi Berbatov        Foo  Little John      50

In [6]:
#top 3 rows
df.head(3)

            Name Department     Manager  Salary
0     Robin Hood        NaN         NaN     200
1  Arsene Wenger        Bar  Friar Tuck      50
2     Friar Tuck        Foo  Robin Hood     100

In [7]:
df.tail(2)

            Name Department      Manager  Salary
4  Sam Allardyce        NaN          NaN     250
5  Dimi Berbatov        Foo  Little John      50

In [8]:
df.tail()

            Name Department      Manager  Salary
1  Arsene Wenger        Bar   Friar Tuck      50
2     Friar Tuck        Foo   Robin Hood     100
3    Little John        Foo   Robin Hood     100
4  Sam Allardyce        NaN          NaN     250
5  Dimi Berbatov        Foo  Little John      50

In [10]:
#particular coumn
df['Name']

0       Robin Hood
1    Arsene Wenger
2       Friar Tuck
3      Little John
4    Sam Allardyce
5    Dimi Berbatov
Name: Name, dtype: object

In [0]:
df[1:,[0]]

In [13]:
#for selecting rows and columns
df.iloc[0:,[0]]

            Name
0     Robin Hood
1  Arsene Wenger
2     Friar Tuck
3    Little John
4  Sam Allardyce
5  Dimi Berbatov

In [14]:
df.iloc[0:,[0,1]]

            Name Department
0     Robin Hood        NaN
1  Arsene Wenger        Bar
2     Friar Tuck        Foo
3    Little John        Foo
4  Sam Allardyce        NaN
5  Dimi Berbatov        Foo

In [16]:
df.iloc[0:,[0,3]]

            Name  Salary
0     Robin Hood     200
1  Arsene Wenger      50
2     Friar Tuck     100
3    Little John     100
4  Sam Allardyce     250
5  Dimi Berbatov      50

In [17]:
#salary column
df['Salary']

0    200
1     50
2    100
3    100
4    250
5     50
Name: Salary, dtype: int64

In [19]:
df['Salary'].max()

250

In [22]:
df['Salary'].values

array([200,  50, 100, 100, 250,  50])